
------    配置常量 ---------

-- 红色长安导标旗酒店坐标='461165'
红色长安城导标旗坐标_酒店={459,164}
红色长安城导标旗坐标_酒店Str='459164'
红色长安城导标旗坐标_酒店屏幕xy={1571,501}

红色长安城导标旗坐标_江南野外= {'535','2'}
红色长安城导标旗坐标_江南野外Str = '5352'
红色长安城导标旗坐标_江南野外屏幕xy = {1597,896}

红色长安城导标旗坐标_大唐国境= {'11','3'}
红色长安城导标旗坐标_大唐国境Str = '113'
红色长安城导标旗坐标_大唐国境屏幕xy = {480,882}

红色长安城导标旗坐标_化生寺= {'509','271'}
红色长安城导标旗坐标_化生寺Str = '509271'
红色长安城导标旗坐标_化生寺屏幕xy = {1541,225}

红色长安城导标旗坐标_驿站= {'277','36'}
红色长安城导标旗坐标_驿站Str = '27736'
红色长安城导标旗坐标_驿站屏幕xy = {1131,811}

红色长安城导标旗坐标_杂货店= {'530','132'}
红色长安城导标旗坐标_杂货店Str = '530132'
红色长安城导标旗坐标_杂货店屏幕xy = {1595,578}

红色长安城导标旗坐标_饰品店= {'390','13'}
红色长安城导标旗坐标_饰品店Str = '39013'
红色长安城导标旗坐标_饰品店屏幕xy = {1262,878}

红色长安城飞行符坐标_飞行棋 = {'361','243'}
红色长安城飞行符坐标_飞行棋Str = '361243'


--- 傲来国预设置坐标点

黄色傲来国导标旗坐标_女儿村 = {'6','138'}
黄色傲来国导标旗坐标_女儿村Str = '6138'
黄色傲来国导标旗坐标_女儿村屏幕xy = {455,260}

黄色傲来国导标旗坐标_东海湾 = {'177','20'}
黄色傲来国导标旗坐标_东海湾Str = '17720'
黄色傲来国导标旗坐标_东海湾屏幕xy = {1266,813}

黄色傲来国导标旗坐标_花果山= {'211','142'}
黄色傲来国导标旗坐标_花果山Str = '211142'
黄色傲来国导标旗坐标_花果山屏幕xy = {1421,240}

黄色傲来国导标旗坐标_布店= {'34','71'}
黄色傲来国导标旗坐标_布店Str = '3471'
黄色傲来国导标旗坐标_布店屏幕xy = {581,572}

黄色傲来国导标旗坐标_药店= {'56','38'}
黄色傲来国导标旗坐标_药店Str = '5638'
黄色傲来国导标旗坐标_药店屏幕xy = {694,733}

黄色傲来国导标旗坐标_捕鱼人= {'186','61'}
黄色傲来国导标旗坐标_捕鱼人Str = '18661'
黄色傲来国导标旗坐标_捕鱼人屏幕xy = {1304,623}

黄色傲来国导标旗坐标_兵器店= {'115','48'}
黄色傲来国导标旗坐标_兵器店Str = '11548'
黄色傲来国导标旗坐标_兵器店屏幕xy = {967,687}

黄色傲来国飞行符坐标_飞行棋 = {'123','94'}
黄色傲来国飞行符坐标_飞行棋Str = '12394'
黄色傲来国飞行符坐标_屏幕xy = {1528,791}

傲来国布店_已进入坐标Str='368'
傲来国药店_已进入坐标Str='3711'





--- 长寿村预设置坐标点
-- 绿色长寿村导标旗坐标_长寿郊外= {'140','8'}
-- 绿色长寿村导标旗坐标_长寿郊外Str = '1408'
-- 绿色长寿村导标旗坐标_长寿郊外屏幕xy = {1165,899}

绿色长寿村导标旗坐标_长寿郊外= {'142','5'}
绿色长寿村导标旗坐标_长寿郊外Str = '1425'
绿色长寿村导标旗坐标_长寿郊外屏幕xy = {1165,899}

绿色长寿村导标旗坐标_方寸山= {'109','202'}
绿色长寿村导标旗坐标_方寸山Str = '109202'
绿色长寿村导标旗坐标_方寸山屏幕xy = {1221,224}

-- 绿色长寿村导标旗坐标_酒店= {'98','141'}
-- 绿色长寿村导标旗坐标_酒店Str = '98141'
-- 绿色长寿村导标旗坐标_酒店屏幕xy = {1017,431}

绿色长寿村导标旗坐标_酒店= {'109','146'}
绿色长寿村导标旗坐标_酒店Str = '109146'
绿色长寿村导标旗坐标_酒店屏幕xy = {1220,415}

绿色长寿村导标旗坐标_当铺= {'18','126'}
绿色长寿村导标旗坐标_当铺Str = '18126'
绿色长寿村导标旗坐标_当铺屏幕xy = {910,481}

绿色长寿村导标旗坐标_村长家= {'19','36'}
绿色长寿村导标旗坐标_村长家Str = '1936'
绿色长寿村导标旗坐标_村长家屏幕xy = {911,800}

绿色长寿村导标旗坐标_钟书生= {'47','162'}
绿色长寿村导标旗坐标_钟书生Str = '47162'
绿色长寿村导标旗坐标_钟书生屏幕xy = {1107,359}

绿色长寿村导标旗坐标_孟婆婆= {'41','80'}
绿色长寿村导标旗坐标_孟婆婆Str = '4180'
绿色长寿村导标旗坐标_孟婆婆屏幕xy = {990,646}


白色朱紫国导标旗坐标_大唐境外= {'6','3'}
白色朱紫国导标旗坐标_大唐境外Str = '63'
白色朱紫国导标旗坐标_大唐境外屏幕xy = {589,893}


白色朱紫国导标旗坐标_麒麟山= {'6','108'}
白色朱紫国导标旗坐标_麒麟山Str = '6108'
白色朱紫国导标旗坐标_麒麟山屏幕xy = {413,271}

白色朱紫国导标旗坐标_妖怪亲信= {'107','113'}
白色朱紫国导标旗坐标_妖怪亲信Str = '107113'
白色朱紫国导标旗坐标_妖怪亲信屏幕xy = {1021,238}

白色朱紫国导标旗坐标_酒店= {'52','42'}
白色朱紫国导标旗坐标_酒店Str = '5242'
白色朱紫国导标旗坐标_酒店屏幕xy = {693,666}

白色朱紫国导标旗坐标_申太公= {'83','9'}
白色朱紫国导标旗坐标_申太公Str = '839'
白色朱紫国导标旗坐标_申太公屏幕xy = {881,861}

白色朱紫国导标旗坐标_小团团= {'145','7'}
白色朱紫国导标旗坐标_小团团Str = '1457'
白色朱紫国导标旗坐标_小团团屏幕xy = {1254,879}

白色朱紫国导标旗坐标_紫阳药师附近= {'173','36'}
白色朱紫国导标旗坐标_紫阳药师附近Str = '17336'
白色朱紫国导标旗坐标_紫阳药师附近屏幕xy = {1416,703}

大唐国境入口_非驿站路线= {'337','146'}
大唐国境入口_驿站路线= {'86','252'}

关闭仓库={ 1753,94,0x18374e, 1754,94,0x183850, 1755,94,0x183850, 1756,94,0x183850, 1757,94,0x183850, 1758,94,0x183850, 1759,94,0x183850, 1760,94,0x183850, 1761,94,0x183850}

地图仓库对应关系 = { 
	花果山= 25,
	傲来国 = 24,
	狮驼岭 = 23,
	大唐境外 = 22,
	普陀山 = 21,
	墨家村 = 20,
	北俱芦洲 = 19,
	朱紫国 = 18,
	大唐国境 = 17,
	麒麟山 = 16,
	长寿郊外 = 15,
	东海湾 = 14,
	五庄观 = 13,
	江南野外 = 12,
	建邺城 = 11,
	女儿村 = 10,
}
